src/Reports/ОтчётПоВзаимодействиюСВнутреннимиПоставщиками/ОтчётПоВзаимодействиюСВнутреннимиПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоВзаимодействиюСВнутреннимиПоставщиками</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеНаЛинейку/ПоступлениеНаЛинейку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаЛинейку</name>
  <basedOn>Document.ПередачаНаЛинейку</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиНаЛинейки</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПередачаНаЛинейку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчётПоВзаимодействиюСВнутреннимиПоставщиками/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьДатуВыпуска(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.ДокументОснование = &ДокументОснование
	|	И ВыпускПродукцииКанбан.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Функция ПолучитьДатуВыпускаДо(Изделие,ДатаДо)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыпускПродукцииКанбан.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Изделие = &Изделие
	|	И ВыпускПродукцииКанбан.Дата <= &ДатаДо
	|	И ВыпускПродукцииКанбан.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
Запрос.УстановитьПараметр("Изделие", Изделие);
Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции 

&НаСервере
Функция ПолучитьДатуПеремещения(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.Дата КАК Дата
	|ИЗ
	|	Документ.ДвижениеМПЗ КАК ДвижениеМПЗ
	|ГДЕ
	|	ДвижениеМПЗ.ДокументОснование = &ДокументОснование
	|	И ДвижениеМПЗ.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоНевостребованных(МТК,Изделие)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование = &ДокументОснование
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.МестоХранения = &МестоХранения
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ = &МПЗ";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
Запрос.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.НайтиПоНаименованию("Невостребованные полуфабрикаты МО",Истина));
Запрос.УстановитьПараметр("МПЗ", Изделие);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
Возврат(0);
КонецФункции

&НаСервере
Функция ПолучитьДатуПоступленияДо(Изделие,ДатаДо)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеНаЛинейку.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеНаЛинейку КАК ПоступлениеНаЛинейку
	|ГДЕ
	|	ПоступлениеНаЛинейку.МПЗ = &МПЗ
	|	И ПоступлениеНаЛинейку.Дата = &ДатаДо
	|	И ПоступлениеНаЛинейку.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
Запрос.УстановитьПараметр("МПЗ", Изделие);
Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Функция ПолучитьДатыЛО(ГоловнаяМТК,Номенклатура)
Парам = Новый Структура("ДатаПостановки,ДатаОкончания",Дата(1,1,1),Дата(1,1,1));
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Изделие КАК Изделие,
	|	ЛьготнаяОчередь.Период КАК Период,
	|	ЛьготнаяОчередь.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДокументОснование = &МТК
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент = &Элемент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
Запрос.УстановитьПараметр("МТК", ГоловнаяМТК);
Запрос.УстановитьПараметр("Элемент", Номенклатура);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
НомСтр = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НомСтр = 1 Тогда
		Парам.ДатаПостановки = ВыборкаДетальныеЗаписи.Период;				
		КонецЕсли;
	Парам.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания; 
	НомСтр = НомСтр + 1;
	КонецЦикла;	
Возврат(Парам);
КонецФункции 

&НаСервере
Процедура СформироватьПоНестандартнымПФ()
ТабДок.Очистить();

ТЗ = Новый ТаблицаЗначений;

ТЗ.Колонки.Добавить("Линейка");
ТЗ.Колонки.Добавить("ГоловнаяМТК");
ТЗ.Колонки.Добавить("МТК");
ТЗ.Колонки.Добавить("ПФ");
ТЗ.Колонки.Добавить("КоличествоНПФ");
ТЗ.Колонки.Добавить("ДатаВыпуска");
ТЗ.Колонки.Добавить("ДатаПеремещения");
ТЗ.Колонки.Добавить("ДатаПостановки");
ТЗ.Колонки.Добавить("ДатаОкончания");

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблГоловнаяМТК = Макет.ПолучитьОбласть("ГоловнаяМТК");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблПФ = Макет.ПолучитьОбласть("ПФ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
ЗапросНПФ = Новый Запрос;

ЗапросНПФ.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ДвижениеМПЗТабличнаяЧасть.Количество КАК Количество,
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование КАК МТК
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.МестоХранения = &МестоХранения
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ.Канбан.ПодразделениеДляСебестоимости В(&СписокПодразделений)
	|ИТОГИ ПО
	|	МТК,
	|	МПЗ";
ЗапросНПФ.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
ЗапросНПФ.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
ЗапросНПФ.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.НайтиПоНаименованию("Невостребованные полуфабрикаты МО",Истина));
ЗапросНПФ.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
ЗапросНПФ.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = ЗапросНПФ.Выполнить();
ВыборкаНПФ_МТК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНПФ_МТК.Следующий() Цикл
	ВыборкаМПЗ = ВыборкаНПФ_МТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМПЗ.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаМПЗ.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТЧ = ТЗ.Добавить();
			ТЧ.Линейка = ВыборкаНПФ_МТК.МТК.Линейка;
			ТЧ.ГоловнаяМТК = ВыборкаНПФ_МТК.МТК;
			ТЧ.ПФ = ВыборкаМПЗ.МПЗ;
			ТЧ.КоличествоНПФ = ВыборкаДетальныеЗаписи.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование.Линейка КАК Линейка,
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование КАК ГоловнаяМТК,
	|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
	|	ПроизводственноеЗадание.Ссылка КАК ПЗ
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПроизводственноеЗадание.Подразделение В(&СписокПодразделений)
	|	И ПроизводственноеЗадание.ДокументОснование.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ТИПЗНАЧЕНИЯ(ПроизводственноеЗадание.ДокументОснование.ДокументОснование) = ТИП(Документ.МаршрутнаяКарта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Линейка,
	|	МТК
	|ИТОГИ ПО
	|	Линейка,
	|	ГоловнаяМТК,
	|	МТК";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	ВыборкаГоловнаяМТК = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГоловнаяМТК.Следующий() Цикл
		ВыборкаМТК = ВыборкаГоловнаяМТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМТК.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Выборка = ТЗ.НайтиСтроки(Новый Структура("Линейка,ГоловнаяМТК,ПФ",ВыборкаЛинейка.Линейка,ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура));
					Если Выборка.Количество() = 0 Тогда
					ТЧ = ТЗ.Добавить();
					ТЧ.Линейка = ВыборкаЛинейка.Линейка;
					ТЧ.ГоловнаяМТК = ВыборкаГоловнаяМТК.ГоловнаяМТК;
					ТЧ.МТК = ВыборкаМТК.МТК;
					ТЧ.ПФ = ВыборкаМТК.МТК.Номенклатура;					
					ТЧ.ДатаВыпуска = ПолучитьДатуВыпуска(ВыборкаДетальныеЗаписи.ПЗ);	
					ТЧ.ДатаПеремещения = ПолучитьДатуПеремещения(ВыборкаДетальныеЗаписи.ПЗ);
					Результат = ПолучитьДатыЛО(ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура);
					ТЧ.ДатаПостановки = Результат.ДатаПостановки;
					ТЧ.ДатаОкончания = Результат.ДатаОкончания;
					Иначе
					Выборка[0].МТК = ВыборкаМТК.МТК;
					Выборка[0].ДатаВыпуска = ПолучитьДатуВыпуска(ВыборкаДетальныеЗаписи.ПЗ);	
					Выборка[0].ДатаПеремещения = ПолучитьДатуПеремещения(ВыборкаДетальныеЗаписи.ПЗ);
					Результат = ПолучитьДатыЛО(ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура);
					Выборка[0].ДатаПостановки = Результат.ДатаПостановки;
					Выборка[0].ДатаОкончания = Результат.ДатаОкончания;					
					КонецЕсли;				
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
ТЗ.Сортировать("Линейка,ГоловнаяМТК,ПФ");
ТекЛинейка = Неопределено;
ТекГоловнаяМТК = Неопределено;
	Для каждого ТЧ Из ТЗ Цикл
		Если ТекЛинейка <> ТЧ.Линейка Тогда
			Если ТекЛинейка <> Неопределено Тогда
				Если ТекГоловнаяМТК <> Неопределено Тогда				
				ТабДок.ЗакончитьГруппуСтрок();
				КонецЕсли;				
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;          		
		ТекЛинейка = ТЧ.Линейка;
		ОблЛинейка.Параметры.Линейка = ТЧ.Линейка;
		ТабДок.Вывести(ОблЛинейка);
		ТабДок.НачатьГруппуСтрок("Линейка",Истина);
		ТекГоловнаяМТК = ТЧ.ГоловнаяМТК;
		ОблГоловнаяМТК.Параметры.МТК = ТЧ.ГоловнаяМТК;
		ОблГоловнаяМТК.Параметры.Наименование = СокрЛП(ТЧ.ГоловнаяМТК.Номенклатура.Наименование);
		ОблГоловнаяМТК.Параметры.Изделие = ТЧ.ГоловнаяМТК.Номенклатура;
		ОблГоловнаяМТК.Параметры.Количество = ТЧ.ГоловнаяМТК.Количество;
		ТабДок.Вывести(ОблГоловнаяМТК);
		ТабДок.НачатьГруппуСтрок("ГоловнаяМТК",Истина);	
		КонецЕсли; 
			Если ТекГоловнаяМТК <> ТЧ.ГоловнаяМТК Тогда
				Если ТекГоловнаяМТК <> Неопределено Тогда				
				ТабДок.ЗакончитьГруппуСтрок();
				КонецЕсли;          		
			ТекГоловнаяМТК = ТЧ.ГоловнаяМТК;
			ОблГоловнаяМТК.Параметры.МТК = ТЧ.ГоловнаяМТК;
			ОблГоловнаяМТК.Параметры.Наименование = СокрЛП(ТЧ.ГоловнаяМТК.Номенклатура.Наименование);
			ОблГоловнаяМТК.Параметры.Изделие = ТЧ.ГоловнаяМТК.Номенклатура;
			ОблГоловнаяМТК.Параметры.Количество = ТЧ.ГоловнаяМТК.Количество;
			ТабДок.Вывести(ОблГоловнаяМТК);
			ТабДок.НачатьГруппуСтрок("ГоловнаяМТК",Истина);	
			КонецЕсли; 
	ОблПФ.Параметры.МТК = ТЧ.МТК;
	ОблПФ.Параметры.Наименование = СокрЛП(ТЧ.ПФ.Наименование);
	ОблПФ.Параметры.Изделие = ТЧ.ПФ;
	ОблПФ.Параметры.ДатаВыпуска = ТЧ.ДатаВыпуска;
	ОблПФ.Параметры.ДатаПеремещения = ТЧ.ДатаПеремещения;
	ОблПФ.Параметры.КоличествоНевостребованных = ТЧ.КоличествоНПФ;
	ОблПФ.Параметры.ДатаПостановки = ТЧ.ДатаПостановки;
	ОблПФ.Параметры.ДатаОкончания = ТЧ.ДатаОкончания;
	ТабДок.Вывести(ОблПФ);		
	КонецЦикла; 
		Если ТекЛинейка <> Неопределено Тогда				
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЕсли; 
			Если ТекГоловнаяМТК <> Неопределено Тогда				
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаСервере
Процедура СформироватьПоСтандартнымПФ()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет2");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Линейка КАК Линейка,
	|	ЛьготнаяОчередь.ПЗ.ДокументОснование КАК МТК,
	|	ЛьготнаяОчередь.Период КАК Период,
	|	ЛьготнаяОчередь.ДатаОкончания КАК ДатаОкончания,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК ПФ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ЛьготнаяОчередь.ПЗ.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент.Канбан.Подразделение В(&СписокПодразделений)
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент.Канбан.Служебный = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Линейка,
	|	МТК,
	|	ПФ,
	|	Период
	|ИТОГИ ПО
	|	Линейка,
	|	МТК,
	|	ПФ";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	ОблЛинейка.Параметры.Линейка = ВыборкаЛинейка.Линейка;
	ТабДок.Вывести(ОблЛинейка);
	ТабДок.НачатьГруппуСтрок("Линейка",Истина);
	ВыборкаМТК = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМТК.Следующий() Цикл
		Номенклатура = ВыборкаМТК.МТК.Номенклатура;
		ОблМТК.Параметры.МТК = ВыборкаМТК.МТК;
		ОблМТК.Параметры.Наименование = СокрЛП(Номенклатура.Наименование);
		ОблМТК.Параметры.Изделие = Номенклатура;
		ОблМТК.Параметры.Количество = ВыборкаМТК.МТК.Количество;
		ТабДок.Вывести(ОблМТК);
		ТабДок.НачатьГруппуСтрок("МТК",Истина);
		ВыборкаПФ = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПФ.Следующий() Цикл
			ПФ = ВыборкаПФ.ПФ;
			ОблПЗ.Параметры.Наименование = СокрЛП(ПФ.Наименование);
			ОблПЗ.Параметры.Изделие = ПФ;			
			ЯчейкиКомплектации = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектации(ВыборкаЛинейка.Линейка,ПФ);
			ОблПЗ.Параметры.КолЯчеек = ЯчейкиКомплектации.КоличествоЯчеек;
			ОблПЗ.Параметры.КолВЯчейке = ЯчейкиКомплектации.КоличествоВЯчейке;
			ОблПЗ.Параметры.ТочкаЗаказа = ЯчейкиКомплектации.ТочкаЗаказа;
			ОблПЗ.Параметры.ДатаВыпуска = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаПоступления = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаПостановки = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаОкончания = Дата(1,1,1); 
			НомСтр = 1;
			ВыборкаДетальныеЗаписи = ВыборкаПФ.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если НомСтр = 1 Тогда
					ОблПЗ.Параметры.ДатаПостановки = ВыборкаДетальныеЗаписи.Период;
					КонецЕсли; 
				ОблПЗ.Параметры.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;			
				НомСтр = НомСтр + 1;
				КонецЦикла;
					Если ОблПЗ.Параметры.ДатаОкончания <> Дата(1,1,1) Тогда
					ОблПЗ.Параметры.ДатаВыпуска = ПолучитьДатуВыпускаДо(ПФ,ОблПЗ.Параметры.ДатаОкончания);
					ОблПЗ.Параметры.ДатаПоступления = ПолучитьДатуПоступленияДо(ПФ,ОблПЗ.Параметры.ДатаОкончания);				
					КонецЕсли;
			ТабДок.Вывести(ОблПЗ); 
			КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ВидОтчёта = 0 Тогда	
	СформироватьПоНестандартнымПФ();	
	Иначе
	СформироватьПоСтандартнымПФ();
	КонецЕсли;	 
КонецПроцедуры
